///	>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
///	@file		Application.h
///	@brief		アプリケーション管理
///	>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

#ifndef HICHAN_APP_APPLICATION_H
#define HICHAN_APP_APPLICATION_H

/////////////////////////////////////////////////////////////////////////////////
///	@		前方宣言
class Window;
typedef std::shared_ptr< Window > WindowPtr;

///	=============================================================================
///	@brief		アプリケーション管理クラス
///	=============================================================================
class Application
{
public:
	///	-----------------------------------------------------------------------------
	///	@brief		メッセージキューにある全てのwindowsイベントを処理する。
	///	@return		WM_QUITメッセージを受け取ったかどうか
	///	-----------------------------------------------------------------------------
    static bool DoEvents();
	
	///	-----------------------------------------------------------------------------
	///	@brief		指定サイズのクライアント領域を持つ、ゲーム用の単純なウィンドウを作成する
	///	@param		title   ウィンドウのタイトルを指定
	///	@param		width   クライアント領域の幅を指定
	///	@param		height  クライアント領域の高さを指定
	///	@return		生成したWindowクラスへのstd::shared_ptrを返す。失敗時はnullptrを返す。
	///	-----------------------------------------------------------------------------
    static WindowPtr CreateGameWindow( const std::string& title, int client_width, int client_height );

};


#endif